Revit 2027 API
ExportPatternTable.ContainsKey Method
 Checks whether a pattern key exists in the table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsKey(
	ExportPatternKey exportpatternKey
)
Public Function ContainsKey (
	exportpatternKey As ExportPatternKey
) As Boolean
public:
bool ContainsKey(
	ExportPatternKey^ exportpatternKey
)
member ContainsKey :
        exportpatternKey : ExportPatternKey -> bool
Parameters
exportpatternKey ExportPatternKey
 The export pattern Key.
Return Value
Boolean
 True if the pattern key exists in the table.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportPatternTable Class
Autodesk.Revit.DB Namespace